# Создать lambda функцию, которая принимает на вход имя и выводит его в формате “Hello, {name}”

func = lambda name: f"Hello, {name}"
print(func("Joza"))